FtpClient/FileSetMan/FileSetManSoap12.CommitError.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
 xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns2="http://localhost/FSM/FileSetManSoap"
 xmlns:ns1="http://localhost/FSM"
 xmlns:ns3="http://localhost/FSM/FileSetManSoap12">
 <SOAP-ENV:Body>
   <ns1:CommitError>
    <ns1:msg></ns1:msg>
   </ns1:CommitError>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
